#include "func.h"

void roadmap_job_consult(void)
{
	system("clear");
	printf("[보안 로드맵]\n");
	printf("  └ [보안 직업군]\n");
	printf("      └ [보안 컨설턴트]\n\n");

	printf("이번에 살펴볼 보안 직업군은 \"보안 컨설턴트\" 입니다.\n\n");
	printf("\"보안 컨설턴트\"는 기업에서 보안 컨설팅을 담당하는 직업군입니다.\n");
	next_line();
	
	printf("일정 규모 이상의 기업들은 자산을 보호하기 위해서\n");
	printf("보안에 대한 여러 가지 측면을 고려하게 됩니다.\n");
	next_line();

	printf("따라서 전문적인 보안 업무 능력을 갖춘 \"보안 컨설턴트\"를 고용하여\n");
	printf("기업의 전반적인 보안을 점검할 수 있도록 맡기는 것입니다.\n");
	next_line();
	
	// 보안 컨설턴트의 업무
	system("clear");
	printf("그렇다면 \"보안 컨설턴트\"는 어떤 업무를 수행할까요?\n");
	next_line();
	
	printf("기본적으로 기업에서는 법으로 정한 보안 점검 사항을 지킬 의무가 있습니다.\n");
	printf("하지만 이러한 점검 사항을 기업 내부에서 자체적으로 점검하기엔 난이도가 있습니다.\n");
	next_line();
	
	printf("\"보안 컨설턴트\"는 이러한 법적 점검 사항을 체크하고\n");
	printf("그 결과를 기업 내의 담당자에게 알기 쉽게 설명해줍니다.\n\n");
	next_line();
	
	printf("또한 보안을 위한 다양한 인증 체계가 존재합니다.\n");
	next_line();
	
	printf("가장 대표적인 인증은 \"ISMS-P\", \"ISO27001\" 등이 있습니다.\n");
	next_line();
	
	printf("기업은 이러한 인증을 받기 위해 \"보안 컨설턴트\"에게 의뢰를 하게 됩니다.\n");
	next_line();
	
	printf("이 같은 \"인증\"은 정보 보호의 수준을 나타내는 것 뿐만 아니라\n");
	printf("어떤 기관에서는 인증이 필수적이기 때문에 매우 중요합니다.\n");
	next_line();
	
	printf("이외에도 고객의 데이터를 안전하게 관리하기 위해\n");
	printf("보안이 중요한 기업에서도 \"보안 컨설턴트\"를 필요로 합니다.\n");
	next_line();
	
	printf("4차 산업혁명 이후 정보의 가치가 급격하게 상승했기 때문에\n");
	printf("사실 모든 기업에 \"보안 컨설턴트\"가 필요하다고 봐도 무방합니다.\n");
	next_line();
	
	// 보안 컨설턴트의 소양
	system("clear");
	printf("\"보안 컨설턴트\"는 한 기업의 보안 전반에 대한 관리를 합니다.\n");
	next_line();
	
	printf("따라서 기본적으로 다양한 보안 지식이 필요합니다.\n");
	next_line();
	
	printf("그리고 보안 시스템에서 일어나는 다양한 변수에 대해 알고 있어야 합니다.\n");
	printf("이러한 것들은 단순한 지식이 아닌 경험으로부터 우러나오는 지식입니다.\n");
	next_line();
	
	printf("따라서 \"보안 컨설턴트\"의 경우 일정한 경력을 요구하는 경우가 많습니다.\n\n");
	next_line();
	
	printf("다음으로는 법에 대한 이해입니다.\n");
	next_line();
	
	printf("\"보안 컨설턴트\"는 위에서 언급한 것과 같이 \n");
	printf("인증 체계나 법적 요구 사항을 다루는 경우가 많습니다.\n");
	next_line();
	
	printf("따라서 기업과 보안에 관련된 법에 대해 잘 알고 있어야 하며\n");
	printf("이를 기업의 환경에 맞게 적용시킬 수 있어야 합니다.\n");
	next_line();
	
	printf("또한 기업은 기본적으로 영리를 추구하려는 목적으로 운영되므로\n");
	printf("보안의 강도와 기업의 이윤 추구 사이에서 균형점을 찾는 것이 가능해야 합니다.\n\n");
	next_line();
	
	printf("마지막으로, 뛰어난 커뮤니케이션 능력이 필요합니다.\n");
	next_line();
	
	printf("\"보안 컨설턴트\"는 보안 시스템에 대해 이해하는 것 뿐만 아니라\n");
	printf("이에 대한 설명을 기업 임원들에게 알기 쉽게 설명해야 합니다.\n");
	next_line();
	
	printf("보안 분야 종사자들에게는 전문 용어나 세세한 기술적 설명이 가능하지만\n");
	printf("기업 임원들은 이러한 용어들이나 설명을 이해 하지 못할 수도 있습니다.\n");
	next_line();
	
	printf("따라서 설명하려는 대상에 따라 눈높이에 맞추어 잘 설명할 수 있어야 합니다.\n\n");
	next_line();
	
	printf("또한 \"보안 컨설턴트\"의 특성상 다양한 사람들 앞에서\n");
	printf("자신의 의견이나 계획을 발표해야 하는 경우가 많습니다.\n");
	next_line();
	
	printf("이러한 이유로 프리젠테이션을 보기 쉽게 구성하고\n");
	printf("보고서를 체계적으로 작성하는 등 다양한 문서 작성 역량도 필요합니다.\n");
	next_line();
	
	printf("그리고 프로젝트를 진행하는 경우 팀 간의 커뮤니케이션을 조율하는 경우 등\n");
	printf("다양한 상황에 있어서 커뮤니케이션 능력은 핵심 능력입니다.\n");
	next_line();
	
	system("clear");
	// 보안 컨설턴트의 장점
	printf("위에서 언급된 사항만 살펴보아도 \"보안 컨설턴트\"에게\n");
	printf("요구되는 소양이 많음을 알 수가 있습니다.\n");
	next_line();
	
	printf("하지만 이렇게 많은 능력을 요구하는 만큼, 이에 대한 보상도 상당합니다.\n");
	next_line();
	
	printf("우선, 정보화 시대에 들어서 정보라는 자산의 가치가 급상승 했습니다.\n");
	printf("따라서 많은 기업들이 정보를 지키기 위해 보안에 비용을 지출하는 추세입니다.\n");
	next_line();
	
	printf("특히 유명 대기업이나 중견 기업의 경우 보안의 가치가 더 중요하기 때문에\n");
	printf("고액의 보수를 제공하여 실력 있는 \"보안 컨설턴트\"를 고용하려고 합니다.\n");
	next_line();
	
	printf("연봉만으로 직업의 가치가 매겨지는 것은 아니지만\n");
	printf("직업 선택에 있어서 중요한 고려 사항 중 하나입니다.\n");
	next_line();
	
	printf("또한 경력이 쌓일 수록 더 많은 경험과 능력을 가지게 됩니다.\n");
	next_line();
	
	printf("많은 사람들이 비교적 이른 시기에 은퇴를 하게 되는 IT 분야에서\n");
	next_line();
	
	printf("오랫동안 직업을 유지할 수 있다는 점도 \"보안 컨설턴트\"의 장점입니다.\n");
	next_line();
	
	// 마무리
	system("clear");
	printf("지금까지 \"보안 컨설턴트\"에 대해 알아 보았습니다.\n");
	next_line();
	
	printf("\"보안 컨설턴트\"가 되기 위해선 많은 능력을 필요로 하지만\n");
	printf("그 만큼 매력적이고 장점이 많은 직업군입니다.\n");
	next_line();
	
	printf("다양한 사람들과 커뮤니케이션하는 것을 즐기고\n");
	printf("상대방을 설득시키는 능력이 뛰어난 분이라면\n");
	next_line();
	
	printf("\"보안 컨설턴트\"에 도전해보는 것도 좋은 선택입니다.\n");
	next_line();
	
	printf("\"보안 컨설턴트\" 직업군 로드맵이 종료되었습니다.\n");
}
