#include "func.h"

void roadmap_job_dev(void)
{
	system("clear");
	printf("[보안 로드맵]\n");
	printf("  └ [보안 직업군]\n");
	printf("      └ [보안 제품 개발자]\n\n");

	// 모의 해킹 전문가 인트로 
	printf("이번에 살펴볼 보안 직업군은 \"보안 제품 개발자\" 입니다.\n\n");
	
	printf("여러분은 혹시 지금 하고 있는 트레이닝이 어디서 만들어졌는지 알고 계신가요?\n");
	next_line();
	
	printf("바로 BoB의 \"보안 제품 개발\" 트랙입니다!\n");
	next_line();
	
	printf("\"보안 제품 개발자\"는 보안과 관련된 제품이나 솔루션을 만드는 일을 합니다.\n");
	next_line();
	
	printf("흔히 알고 계시는 \"안랩\"의 \"V3\", \"이스트소프트\"의 \"알약\" 등\n");
	printf("다양한 백신 프로그램도 넓은 범주에서 보안 제품의 일부분입니다.\n");
	next_line();
	
	// 보안 제품 개발자의 업무와 소양
	system("clear");
	printf("\"보안 제품 개발자\"는 다양한 보안 공격에 맞서서\n");
	printf("공격을 방어할 수 있는 다양한 제품과 솔루션을 개발합니다.\n");
	next_line();
	
	printf("기업 및 기관들은 자신들의 정보를 안전하게 유지하기 위해서\n");
	printf("다양한 보안 관련 제품을 사용하고 있습니다.\n");
	next_line();
	
	printf("\"보안 제품 개발자\"는 고객의 요구에 맞는 제품을 개발하여\n");
	printf("해당 환경에 맞는 보안을 제공합니다.\n\n");
	next_line();
	
	printf("\"보안 제품 개발자\"에게는 먼저 프로그래밍 능력이 필요합니다.\n");
	next_line();
	
	printf("다양한 프로그램을 만들 때 해당 프로그램의 목적에 맞는\n");
	printf("프로그래밍 언어, 알고리즘, 자료구조 등을 선택해야 합니다.\n");
	next_line();
	
	printf("이러한 내용들은 대부분 \"컴퓨터 공학과\"에서 배우는 것들 입니다.\n");
	next_line();
	
	printf("하지만 다른 소프트웨어나 솔루션과는 다르게 보안 제품에 있어서는\n");
	printf("약간의 결함이라도 치명적인 피해를 입힐 수 있습니다.\n");
	next_line();
	
	printf("따라서 보안에 대한 심도 깊은 이해와 꼼꼼함이 요구됩니다.\n\n");
	next_line();
	
	printf("또한 보안에 있어서 완벽한 것은 현재까지 존재하지 않습니다.\n");
	next_line();
	
	printf("어떠한 제품이라도 언젠간 취약점이 발견될 수 있고\n");
	printf("변화하는 기술에 맞추어 보안 제품도 변화해야 합니다.\n");
	next_line();
	
	printf("이러한 점에서 \"보안 제품 개발자\"는 최신 기술 트렌드와\n");
	printf("다양한 최신 취약점에 대해 관심을 가지고 있어야 합니다.\n");
	next_line();
	
	// 보안 제품 개발자의 장점
	system("clear");
	printf("최근에는 정보시스템에 대한 다양한 공격과 이로 인한 피해가 급증하면서\n");
	printf("뛰어난 보안 제품에 대한 수요가 증가하고 있습니다.\n");
	next_line();
	
	printf("예를 들어 \"랜섬웨어\" 같은 경우 기업의 모든 정보를 암호화 시킨 후\n");
	printf("이를 빌미로 엄청난 금전을 요구하는 등 기업에 큰 타격을 입힐 수 있습니다.\n\n");
	next_line();
	
	printf("기업은 막대한 금액을 지불해야 하는 부담 뿐만 아니라\n");
	printf("해커에게 공격당한 정보들을 한 동안 이용하지 못함으로써\n");
	printf("발생하는 손실까지 부담해야 합니다.\n");
	next_line();
	
	printf("또한 금전을 지불한다고 하더라도 정보를 꼭 복구할 수 있다는 보장도 없습니다.\n");
	next_line();
	
	printf("이러한 상황에서 다양한 보안 제품들의 수요가 급증하였기 때문에\n");
	printf("\"보안 제품 개발자\"에 대한 가치도 중요해지고 있습니다.\n\n");
	next_line();
	
	printf("그리고 \"보안 제품 개발자\"는 보안과 관련된 제품 뿐만 아니라\n");
	printf("다양한 소프트웨어나 솔루션도 개발할 수 있습니다.\n");
	next_line();
	
	printf("\"보안 제품 개발자\"가 가지는 업무의 유연성은\n");
	printf("IT 시장에서 자유롭게 활동할 수 있는 뛰어난 장점이 되기도 합니다.\n");
	next_line();
	
	// 보안 제품 개발자가 되기 위해서 할 일
	system("clear");
	printf("\"보안 제품 개발자\"가 되기 위해서는\n");
	printf("우선 프로그래밍에 대한 이해가 중요합니다.\n");
	next_line();
	
	printf("제품을 개발하기 위해서는 프로그래밍을 몰라서는 안되며\n");
	printf("목적에 맞는 다양한 프로그래밍 언어 지식을 습득해야 합니다.\n\n");
	next_line();
	
	printf("또한 컴퓨터 구조나 운영체제와 같은 시스템과 관련된 지식도 필요합니다.\n");
	next_line();
	
	printf("보안이라는 분야의 특성상 시스템에 대한 제품을 개발하는 경우가 있습니다.\n");
	printf("이 때 'low level'에 대한 이해가 부족하다면\n");
	printf("제품에 중대한 결함이 생길 수 있습니다.\n\n");
	next_line();
	
	printf("지금까지 살펴본 내용들은 대부분 \"컴퓨터 공학과\"에서 배우는 내용들입니다.\n");
	printf("실제로 보안 제품 개발에 종사하는 사람들 중 \"컴퓨터 공학과\" 출신이 많습니다.\n");
	next_line();
	
	printf("하지만, \"보안 제품 개발자\"는 분명한 보안 분야의 직업군입니다.\n");
	printf("따라서 컴퓨터에 대한 지식 뿐만 아니라 보안 취약점과 같은 지식들도 반드시 필요합니다.\n");
	next_line();
	
	// 마무리
	system("clear");
	printf("이처럼 \"보안 제품 개발자\"에게 요구되는 지식의 범위는 상당합니다.\n\n");
	printf("그래서 \"보안 제품 개발자\"의 공부는 끝이 없다고 말하기도 합니다.\n");
	next_line();
	
	printf("하지만 자신이 원하는 대로 제품을 설계하고, 개발할 수 있다는 점이\n");
	printf("\"보안 제품 개발자\"를 선택하는 이유입니다.\n");
	next_line();
	
	printf("제품에 있어서 하나의 체계를 만들고 그 시스템을 구성한다는 것은\n");
	printf("많은 공학자들이 즐거워하고 꿈꾸는 것입니다.\n");
	next_line();
	
	printf("\"보안 제품 개발자\"는 이러한 것들을 작은 모니터 하나에서\n");
	printf("만들어낼 수 있는 매력적인 직업군이라고 할 수 있습니다.\n");
	next_line();
	
	printf("\"보안 제품 개발자\" 직업군 로드맵이 종료되었습니다.\n");	
}

