#include "func.h"

void roadmap_company_fsec(void)
{
	system("clear");
	printf("[보안 로드맵]\n");
	printf("  └ [보안 관련 기관]\n");
	printf("      └ [금융보안원]\n\n");

	// 인트로
	printf("이번에 살펴볼 보안 관련 기관은 \"금융보안원\"입니다.\n\n");
	printf("\"금융보안원\"은 뉴스나 기사에서 접해보신 적이 있을 것입니다.\n");
	next_line();

	printf("이름  그대로 금융권의 보안 전담기구 역할을 수행하고 있으며\n");
	printf("대부분의 사람들이 공공기관으로 오해하고 있지만, 비영리사단법인으로\n");
	printf("공공기관에는 해당하지 않습니다.\n");
	next_line();

	printf("금융보안원에서는 금융권 전반에 걸친 다양한 업무를 수행하고 있습니다.\n");
	next_line();

	printf("금융보안원의 주요 업무는 다음과 같습니다\n\n");
	printf("사이버 위협 대응\n");
	printf("정책 및 기술 연구\n");
	printf("금융권 자율보안 지원\n");
	printf("데이터 경제 활성화 지원\n");
	printf("금융보안 교육\n");
	next_line();
	
	printf("로드맵에서는 보안과 관련된 \"사이버 위협 대응\" 업무 부분에 대해서\n");
	printf("세밀하게 알아보도록 하겠습니다.\n");
	next_line();

	system("clear");
	printf("사이버 위협 대응 업무는 크게 3가지로 나뉩니다.\n");
	printf("먼저 '금융보안관제' 입니다.\n");
	next_line();

	printf("금융보안관제는 \"정보통신기반보호법 제16조\"에 의거해서\n");
	printf("금융분야 정보공유 분석센터인 ISAC을 운영하고 있습니다\n");
	next_line();

	printf("또한 빅데이터 기반 보안관제 기법으로 전 금융권에 대한\n");
	printf("사이버 위협을 24시간 365일 탐지합니다.\n");
	next_line();

	printf("그리고 이 과정에서 다양한 사이버 위협 정보를 공유하고 있으며\n");
	printf("보안전문업체, 금융위원회, 국가사이버안전센터, 금융감독원, KISA\n");
	printf("등의 기관과 협력하고 있습니다.\n\n");
	next_line();

	printf("보안전문업체에 대해서는 침해위협 동향정보와 악성코드를 제공하고\n");
	printf("백신 업데이트를 요청하게 됩니다.\n\n");
	next_line();

	printf("금융위원회에는 침해사고 예보 및 경보 정보를 제공하고\n");
	printf("사이버 침해 위협 분석정보와 침해사고 통계를 공유합니다.\n\n");
	next_line();

	printf("국가사이버안전센터와는 금융권 사이버 위협 특이사항과 침해사고 통계를\n");
	printf("제공하고 탐지 규칙, 국내외 침해 동향, 긴급 보안조치사항을 공유합니다.\n\n");
	next_line();

	printf("금융감독원과는 침해사고 정보를 제공하고\n");
	printf("사이버 침해위협 분석을 공유합니다.\n\n");
	next_line();

	printf("마지막으로 KISA와는 금융정보 불법수집현황을 제공하고\n");
	printf("피싱사이트, 악성코드 유포지, C&C 정보 등을 공유합니다.\n");
	next_line();

	
	
	system("clear");
	printf("사이버 위협 대응의 다음 업무는 \"사이버 침해 대응\"입니다.\n");
	next_line();

	printf("\"금융보안원\"에서는 금융권에 대한 사이버 공격이 발생한 경우\n");
	printf("분석요원이 현장으로 출동하여 증거를 수집하고 디지털 포렌식을 수행합니다.\n");
	next_line();

	printf("이렇게 사고 원인을 분석한 후 피해 확산과 사고 재발을 막기 위해\n");
	printf("금융회사가 대응방안을 수립하는 것을 돕습니다.\n");
	next_line();

	printf("또한 실제 DDoS 공격이나 서버 해킹 공격과 유사한 형태의 침해사고 대응훈련을\n");
	printf("연중 실시하여 금융권의 사이버 공격 대응 역량을 강화하기도 합니다.\n");
	next_line();

	printf("그리고 국내외에서 유포되는 악성코드 중 금융권에 영향을 끼칠 수 있는\n");
	printf("악성코드, 랜섬웨어 등을 수집하고 분석하여 금융회사에 정보를 공유하고 있습니다.\n");
	next_line();

	printf("이렇게 주요 악성코드와 앱을 지속적으로 추적하고 분석한 결과를\n");
	printf("\"금융권 사이버 위협 인텔리전스 보고서\"로 정리해 발간합니다.\n");
	next_line();
	
	system("clear");
	printf("사이버 위협 대응의 마지막 업무는 \"취약점 분석 및 평가\"입니다.\n");
	next_line();
	
	printf("금융보안원에서는 금융회사의 네트워크 장비 및 웹 애플리케이션 등 각종 정보시스템에 \n");
	printf("잠재된 취약점을 찾아내고 조치하여 금융사고를 예방하고 안전한 환경을 조성합니다.\n");
	next_line();
	
	printf("구체적으로는 신용카드VAN, CMS 사업자 등 금융회사로부터\n");
	printf("업무를 위탁받아 사업을 수행하는 전자금융 보조업자를 대상으로\n");
	next_line();
	
	printf("금융회사와 함께 보안 취약점을 합동으로 점검하여\n");
	printf("보안 사각지대를 해소하고자 노력하게 됩니다.\n");
	next_line();
	
	printf("또한 금융당국, 금융보안원, 금융회사, 보안전문업체가 \"TF\"를\n");
	printf("구성하여 2017년 제정된 \"전자금융기반시설 취약점 분석 및 평가기준\"에\n\n");
	printf("최근 신규 보안 취약점을 추가해 매년 개정하여 표준화된 기준으로 활용합니다.\n");
	next_line();
	
	// 마무리
	printf("사이버 위협 대응 대한 업무 중 하나만 살펴봤는데도 상당히 많습니다.\n");
	next_line();
	
	printf("이처럼 금융보안원에서는 금융권의 보안을 위해서 수많은 업무를 수행하고 있습니다.\n");
	next_line();
	
	printf("만약 여러분들이 금융권과 보안 분야를 동시에 관심 있어 하신다면\n");
	printf("금융보안원은 최고의 선택입니다.\n");
	next_line();
	
	printf("금융보안원은 동종업계의 평균보다 많은 연봉을 제공하고 있고\n");
	printf("금융권이라는 특색있는 분야를 다루고 있기 때문에\n");
	printf("이 분야의 전문가가 된다면 관심을 가져보세요!\n");
	next_line();
	
	printf("자세한 내용은 아래의 금융보안원 홈페이지를 참고하세요.\n");
	printf("http://www.fsec.or.kr/fsec/index.do\n");
	next_line();

	printf("\"금융보안원\" 보안 관련 기관 로드맵이 종료되었습니다.\n");
}
