#include "func.h"

void roadmap_company_nis(void)
{
	system("clear");
	printf("[보안 로드맵]\n");
	printf("  └ [보안 관련 기관]\n");
	printf("      └ [국가정보원]\n\n");

	printf("이번에 살펴볼 보안 관련 기관은 \"국가정보원\"입니다.\n\n");
	printf("네. 바로 우리가 알고 있는 국정원입니다!\n");
	next_line();

	printf("국가정보원에서는 대한민국의 다양한 위협으로부터 수호하기 위해\n");
	printf("여러 분야에 걸친 보안 정책을 집행합니다.\n");
	next_line();

	printf("\"넓은 의미의 보안\"에서 대테러, 방첩, 대공수사 등 다양한 업무를 하지만\n");
	printf("여러분과 관련된 업무 분야는 바로 \"사이버 안보\" 분야와 \"산업 보안\" 분야입니다.\n\n");
	next_line();

	printf("먼저 사이버안보 분여를 살펴보겠습니다.\n");
	next_line();

	printf("국가정보원에서는 보안에 대한 위협의 정도를 판단하여\n");
	printf("정상 - 관심 - 주의 - 경계 - 심각 5단계의 사이버위기 경보를 시행합니다.\n");
	next_line();

	printf("해당 경보는 \"국가사이버안전관리규정 제 11조\"에 근거하고 있습니다.\n");
	printf("(국가 기관의 특성상 업무의 법적 근거를 갖추고 있는 경우가 많습니다.)\n");
	next_line();
	
	system("clear");
	printf("경보단계의 세부적 사항은 다음과 같습니다.\n");
	next_line();

	printf("먼저 \"정상 단계\"는 가장 낮은 경보 단계입니다.\n");
	printf("이 단계에서는 전 분야에 정상적인 활동이 가능하며\n");
	next_line();

	printf("일상적인 수준의 사이버 공격이나 악성코드 전파 수준이 일어납니다.\n\n");
	next_line();

	printf("다음 단계는 \"관심 단계\"입니다.\n");
	next_line();

	printf("이 단계에서는 다양한 공격들에 대한 피해 발생 가능성이 증가하고\n");
	printf("해외의 사이버공격 피해가 확산되어 국내에 유입될 우려가 있으며\n");
	next_line();
	
	printf("사이버위협 징후 탐지활동의 강화가 권고됩니다.\n\n");
	next_line();

	printf("세번째 단계는 \"주의 단계\"입니다.\n");
	next_line();

	printf("이 때는 일부 네트워크나 정보시스템 장애가 발생하고\n");
	printf("침해사고가 일부기관에서 발생하거나 다수기관으로 확산될 가능성이 증가합니다.\n");
	next_line();

	printf("이 때는 국가 정보시스템 전반에 보안 태세를 강화하는 것이 필요합니다.\n\n");
	next_line();

	printf("다음은 \"경계 단계\"입니다.\n");
	next_line();

	printf("이 단계에서는 복수의 'ISP' 망에 장애가 생기거나 마비되고\n");
	printf("침해사고가 다수기관에서 발생했거나 대규모 피해로 발전될 가능성이 증가합니다.\n");
	next_line();

	printf("이 때에는 다수 기관의 공주를 통해서 대응을 하는 것이 필요합니다.\n\n");
	next_line();

	printf("마지막 단계은 \"심각 단계\"입니다.\n");
	next_line();

	printf("해당 단계에서는 국가적 차원의 네트워크나 정보시스템이 사용 불가하고\n");
	printf("침해사고가 전국적으로 발생하거나 피해범위가 대규모인 사고가 발생합니다.\n");
	next_line();

	printf("이 때에는 국가적 차원에서 공동 대처가 필요한 만큼\n");
	printf("피해가 심각한 상태입니다.\n");
	next_line();

	// 보안적합성 & 암호모듈 검증
	system("clear");
	printf("지금까지는 국가정보원의 \"사이버위기경보\" 업무를 살펴보았습니다.\n");
	next_line();

	printf("국가정보원의 다음 업무는 \"보안적합성 검증\"입니다.\n");
	next_line();

	printf("보안적합성 검증은 국가정보통신망의 보안 수준 향상을 위해\n");
	printf("\"전자정부법 제56조\"에 의거합니다.\n");
	next_line();

	printf("중앙행정기관이나 주요정보통신기반시설 관리기관 및\n");
	printf("광역시, 도 단위의 기관은 정보보호시스템과 네트워크 장비를 도입 후\n");
	printf("국가정보원에 보안적합성 검증을 신청해야 합니다.\n");
	next_line();

	printf("만약 여기서 취약점이 발견된다면, 해당 취약점을 제거해야만\n");
	printf("해당 시스템을 사용할 수 있습니다.\n\n");
	next_line();
	
	printf("보안적합성 외에 검증 업무로 \"암호모듈 검증\" 업무가 있습니다\n");
	next_line();

	printf("암호모듈 검증은 \"전자정부법 시행령 제69조\"와\n");
	printf("\"암호모듈 시험 및 검증지침\"에 의거 하고 있습니다.\n");
	next_line();
	
	printf("국가 및 공공기관 정보통신망에서 소통되는 자료 중에서\n");
	printf("\"비밀\"로 분류되지 않은 중요 정보의 보호를 위해 사용되는\n");
	printf("암호 모듈의 안정성과 구현 적합성을 검증하고 있습니다.\n");
	next_line();

	system("clear");
	printf("이외에도 국가정보원은 사이버안보 업무 분야에서\n");
	printf("정보보안생활 수칙과 관계법령, 발간물 등을 제공하고 있습니다.\n");
	next_line();
	
	printf("또 다른 보안 관련 업무 분야인 \"산업 보안\" 분야에서는\n");
	printf("\"기술유출현황\"과 \"국가핵심기술\"에 대해 다루고 있습니다.\n");
	next_line();

	printf("만약 여러분이 기업의 \"보안담당자\"나 \"보안 컨설턴트\"가\n");
	printf("되고자 한다면, 해당 내용들을 꼼꼼히 살펴봐야 합니다.\n");
	next_line();
	
	printf("해당 분야에서는 기업이나 공공기관에서 지켜야할 \n");
	printf("다양한 보안 수칙을 제공하고, 기술유출 방지를 위한 정보를 제공합니다.\n");
	next_line();

	printf("또한 분야별 국가핵심기술을 정해 유출되었을 때\n");
	printf("국가적으로 막대한 피해를 초래할 수 있는 기술들에 대해서\n");
	printf("특별하게 취급하여 관리하게 됩니다.\n");
	next_line();
	
	printf("이처럼 \"산업 보안\"에서는 산업계 전반에서 일어날 수 있는\n");
	printf("기술 유출 및 보안에 대한 내용을 다루고 있습니다.\n");
	next_line();

	printf("아마 \"산업 보안\"이라는 분야는 조금 생소한 분야일 수 있으나\n");
	printf("최근에는 이와 관련된 다양한 학과들이 생겨나고 있는 추세입니다.\n");
	next_line();
	
	printf("\"산업 보안\"학과가 개설되어 있는 학교의 정보는 \"학과 로드맵\"을 참고하세요.\n");
	next_line();

	system("clear");
	printf("지금까지 \"국가정보원\"에 대해서 살펴보았습니다.\n");
	next_line();
	
	printf("다양한 위협으로부터 국가를 수호하는 대통령 직속기관인 \"국가정보원\".\n\n");
	next_line();
	
	printf("국가정보원은 대한민국을 다양한 보안 위협으로부터 수호하고\n");
	printf("국민들을 보호하는 우리의 중요 기관입니다.\n");
	next_line();

	printf("다양한 매체에서 딱딱하고 베일에 가려져 있는 기관으로 소개되지만\n");
	printf("사실은 우리 주변에서 보안을 위해서 힘쓰고 있습니다.\n");
	next_line();

	printf("\"국가정보원\" 보안 관련 기관 로드맵이 종료되었습니다.\n");
}
