#include "func.h"

void roadmap_job_forensic(void)
{
	system("clear");
	printf("[보안 로드맵]\n");
	printf("  └ [보안 직업군]\n");
	printf("      └ [디지털 포렌식 전문가]\n\n\n");

	// 모의 해킹 전문가 인트로 
	printf("이번에 살펴볼 보안 직업군은 \"디지털 포렌식 전문가\" 입니다.\n\n");

	printf("여러분들은 \"디지털 포렌식\"에 대해 알고 있으신가요?\n");
	next_line();
	
	printf("디지털 포렌식은 법과 아주 밀접한 관계입니다.\n\n");
	printf("법정이나 수사기관에 제출할 수 있도록 디지털 증거를 수집하고 제출해야 합니다.\n");
	next_line();

	printf("디지털 포렌식은 뉴스에서도 많이 언급되는 분야입니다.\n");
	next_line();

	printf("본래 '포렌식'은 '법의학'이라는 의미로 증거 수집, 분석이란 의미입니다\n");
	next_line();

	printf("\"디지털 포렌식\"은 법의 테두리 안에서 디지털 정보를 수집하여\n");
	printf("용의자나 사건의 실마리를 찾아 법정이나 수사기관에 제출하는 것입니다.\n");
	next_line();

	printf("따라서 디지털 정보를 수집하고 증거를 찾아내는 과정에서 위법 행위가 있어서는 안되고\n");
	printf("해당 데이터 정보를 수집하거나 수사를 해야 하기 때문에 공권력이 필요로 합니다.\n");
	next_line();
	
	printf("디지털 포렌식은 경찰에서 주로 이용되는 방법입니다.\n");
	next_line();
	
	
	// 디지털 포렌식 전문가의 소양
	system("clear");
	printf("\"디지털 포렌식 전문가\"가 준수해야할 내용은 상당히 많습니다.\n");
	next_line();
	
	printf("특히 \"포렌식\" 자체가 \"법과학\"이라는 의미를 담고 있기 때문에\n");
	printf("법에 대한 이해도가 필수적입니다.\n");
	next_line();
	
	printf("또한 디지털 증거가 될 데이터를 다루게 되므로\n");
	printf("데이터에 대한 이해도가 뛰어나야 합니다.\n");
	next_line();
	
	printf("예를 들어 \"휘발성 메모리\"의 경우 시스템을 종료하면\n");
	printf("그 내용이 삭제되므로 적절한 방법으로 데이터를 취급해야 합니다.\n");
	next_line();
	
	printf("만약 이를 인지하지 못하고 시스템을 종료해버렸다면\n");
	printf("중요한 정보들을 잃을 수도 있는 것입니다.\n\n");
	next_line();
	
	printf("그리고 사건에 따라 인터넷 기록, DB, 암호에 대한 내용을 다룰 수도 있습니다.\n");
	next_line();
	
	printf("디지털 포렌식은 보안의 한 분야기도 하지만, 수사 기법 이기도 합니다.\n");
	printf("따라서 다양한 수사 기법에 대한 내용을 숙지하는 것도 중요합니다.\n");
	next_line();

	// 마무리
	system("clear");
	printf("지금까지 \"디지털 포렌식 전문가\"를 살펴보았습니다.\n");
	next_line();
	
	printf("\"디지털 포렌식 전문가\"는 그 특성상 직업의 숙련도가\n");
	printf("상당한 영향을 미치게 됩니다.\n");
	next_line();
	
	printf("매우 숙련된 디지털 포렌식 전문가는\n");
	printf("사소한 증거까지 찾아내어 증거로 채택시킬 수 있지만\n");
	next_line();
	
	printf("비숙련자의 경우 중요한 증거를 눈 앞에 두고도\n");
	printf("잘못 취급하여 증거 능력을 잃어버리거나 훼손합니다.\n");
	next_line();
	
	printf("범죄에 있어서 한 사람의 억울함이 풀릴 수도 있고\n");
	printf("미제로 남을 만한 사건을 해결할 수도 있는 \"디지털 포렌식 전문가\"는\n\n");	
	printf("까다로운 업무 조건을 가지고 있지만\n");
	printf("많은 보람을 느낄 수 있고 꼭 필요한 직업군 입니다.\n");
	next_line();
	
	printf("\"디지털 포렌식 전문가\" 로드맵이 종료되었습니다.\n");
}
