#include "func.h"

void training_whyneedlinux(void)
{
    system("clear");
    //리눅스의 필요성
    printf("[3. 리눅스의 필요성]\n\n");
    printf("대부분의 사람들은 윈도우 운영 체제에 익숙해져 있습니다.\n\n");
    printf("그런 사람들에게 \"Linux\"라는 운영 체제는 생소하고 어렵고 새로울 것입니다.\n\n");
    next_line();
    
    printf("하지만, \"Linux\"는 이미 사람들 일상 속에 존재하며 다양하게 자주 이용되고 있습니다.\n");
    printf("예를 들어, 안드로이드 계열 스마트폰이나 가전 제품이나 여러 임베디드 시스템들입니다.\n\n");
    next_line();

    printf("\"Linux\"는 커널의 이름입니다.\n\n");
    printf("\"Linux\" 커널에 여러 소프트웨어들과 라이브러리들을 합하여 탄생하는 것이\n");
    printf("\"Linux 배포판\"입니다.\n\n");
    printf("이렇듯 \"Linux\"는 컴퓨터 운영 체제들 중 한 종류이자 커널 자체를 의미합니다.\n");
    next_line();

    printf("\"Linux\"의 가장 큰 장점 두 가지는 소스 코드가 공개되어 있다는 것과\n");
    printf("다중 사용자 및 다중 처리를 지원하는 네트워크 운영 체제(NOS)라는 것입니다.\n");
    next_line();

    printf("\"Linux\"는 \"Windows\"와 달리 무료라는 점에서 전 세계적으로 사용자들이\n");
    printf("피드백을 하고 취약점이 발견되면 빠르게 패치할 수 있습니다.\n\n");
    
    printf("그리고 \"Linux\"는 모든 환경을 원하는대로 커스터 마이징하여 사용할 수 있고\n\n");
    printf("개발 친화적인 면 때문에 개발자에게 인기가 많으며\n");
    printf("Linux 서버를 관리하기 쉽기 때문에 엔지니어에게도 인기가 많습니다.\n\n\n");
    next_line();

    printf("정리하자면 \"Linux 시스템\"은 대부분 소스 코드가 오픈되어 있어서 광범위하게 사용되고\n");
    printf("다중 사용자 및 다중 처리를 지원함으로 서버를 운영하기에 적합하고\n\n");
    
    printf("무엇보다 무료인 점으로 인해 전 세계의 사용자로부터 도움을 받을 수 있다는 것입니다.\n\n");
    
    printf("또한 \"Linux\"를 사용하며 공부한다면\n");
    printf("운영체제와 커널의 전체적인 흐름과 동작 원리를 아는 것에 도움이 될 수 있습니다.\n");
    next_line();
}
